[
  {
    "id": "1",
    "title": "PlayerUnknown's Battlegrounds: PUBG Mobile",
    "coverPhoto": "https://wallpapercave.com/wp/wp4037778.jpg",
    "category": "FPS",
    "downloadLink": "https://www.pubgmobile.com/en-US/home.shtml",
    "description": "PUBG Mobile is an intense and fast-paced battle royale game that challenges players to survive, strategize, and emerge victorious on dynamic, large-scale maps. Up to 100 players are dropped onto an island where they must scavenge for weapons, vehicles, and supplies while avoiding deadly encounters. The shrinking safe zone forces players into confrontations, making every decision crucial. PUBG Mobile offers multiple modes, realistic graphics, and customizable controls to enhance the immersive experience. Players can team up with friends or compete solo, participate in ranked matches, and explore seasonal events. With its thrilling gameplay, tactical depth, and constantly updated content, PUBG Mobile remains one of the most popular mobile shooters worldwide.",
    "ratings": 4.5,
    "developer": "Krafton"
  },
  {
    "id": "2",
    "title": "Call of Duty: Mobile",
    "coverPhoto": "https://wallpapers.com/images/featured/call-of-duty-pictures-7lrqnchbx478ucgg.jpg",
    "category": "FPS",
    "downloadLink": "https://www.callofduty.com/mobile",
    "description": "Call of Duty: Mobile delivers the legendary first-person shooter experience directly to smartphones, featuring iconic maps, game modes, and characters from the renowned franchise. Players can engage in fast-paced multiplayer matches, battle royale experiences, and special seasonal events that test their reflexes, strategy, and teamwork. The game offers a wide array of customizable weapons, loadouts, and character skins, allowing players to tailor their gameplay style. With stunning graphics, smooth controls, and competitive ranked modes, Call of Duty: Mobile brings the intensity and excitement of the console experience to mobile devices. Regular updates and community events ensure the gameplay remains fresh, engaging, and highly competitive for players worldwide.",
    "ratings": 4.6,
    "developer": "Activision"
  },
  {
    "id": "3",
    "title": "Genshin Impact",
    "coverPhoto": "https://i0.wp.com/cosplay.ph/wp-content/uploads/2023/08/ad5a19d3870e9597ffd9c82998fd01fe_8246049044075884850.jpg?fit=640%2C400&ssl=1",
    "category": "RPG",
    "downloadLink": "https://genshin.hoyoverse.com/en/",
    "description": "Genshin Impact is a visually stunning open-world action RPG that invites players to explore the vast and diverse continent of Teyvat. Players can control a roster of unique characters, each with elemental powers and abilities, to battle enemies, solve puzzles, and complete quests. The game features an expansive world filled with breathtaking landscapes, hidden secrets, and dynamic weather systems that enhance immersion. Players can team up in co-op mode, gather resources, craft items, and upgrade their characters to tackle increasingly challenging content. With its rich storyline, vibrant graphics, and regular updates, Genshin Impact offers an engaging and ever-evolving adventure for RPG enthusiasts worldwide.",
    "ratings": 4.7,
    "developer": "HoYoverse"
  },
  {
    "id": "4",
    "title": "eFootball 2025",
    "coverPhoto": "https://efootballchampionship.konami.net/media/items/014_efootball_championship-open_1200x600.jpg",
    "category": "Sports",
    "downloadLink": "https://www.konami.com/efootball/en/",
    "description": "eFootball 2025 delivers a highly realistic football experience on mobile devices, featuring improved player physics, smooth animations, and lifelike stadiums. Players can build and manage their dream teams, customize tactics, and compete in online matches against opponents worldwide. The game offers multiple modes, including leagues, tournaments, and friendly matches, allowing for both casual play and competitive challenges. With updated player rosters, realistic ball control, and dynamic weather effects, each match feels authentic and immersive. Frequent updates, seasonal events, and global leaderboards ensure a constantly evolving experience. eFootball 2025 combines strategic team management, skill-based gameplay, and competitive online action, making it a must-play for football fans on mobile platforms.",
    "ratings": 4.4,
    "developer": "Konami"
  },
  {
    "id": "5",
    "title": "Real Cricket 24",
    "coverPhoto": "https://i.ytimg.com/vi/pNMmOIu8Zik/maxresdefault.jpg",
    "category": "Sports",
    "downloadLink": "https://www.nautilusmobile.com/real-cricket/",
    "description": "Real Cricket 24 brings the authentic cricket experience to mobile devices, delivering realistic gameplay, smooth controls, and lifelike animations. Players can bat, bowl, and field in various match formats, including T20, ODI, and Test matches, while enjoying dynamic commentary that adds to the immersive experience. The game features multiple modes such as tournaments, leagues, and practice sessions, allowing players to refine their skills and compete globally. With team customization, player upgrades, and challenging AI opponents, Real Cricket 24 offers a comprehensive cricket simulation. Regular updates, seasonal events, and competitive leaderboards keep gameplay engaging, making it one of the most realistic and entertaining cricket games available for mobile cricket enthusiasts.",
    "ratings": 4.3,
    "developer": "Nautilus Mobile"
  },
  {
    "id": "6",
    "title": "Dream League Soccer 2024",
    "coverPhoto": "https://i.ytimg.com/vi/rqYmFOH8uWU/maxresdefault.jpg",
    "category": "Sports",
    "downloadLink": "https://www.ftgames.com/games/dream-league-soccer",
    "description": "Build your ultimate football team in this immersive mobile game, where you can manage top players, customize strategies, and compete in high-stakes matches. Collect and train athletes from around the world to create a squad that suits your playstyle, then take them onto realistic stadiums with stunning graphics and smooth gameplay. Participate in leagues, tournaments, and seasonal events to test your team against global competitors, earning rewards and climbing leaderboards. The game also offers tactical management, live events, and daily challenges that keep the experience fresh and engaging. Whether attacking, defending, or planning team strategies, players enjoy the excitement and realism of professional football on their mobile devices.",
    "ratings": 4.4,
    "developer": "First Touch Games"
  },
  {
    "id": "7",
    "title": "Free Fire MAX",
    "coverPhoto": "https://wallpapercave.com/wp/wp12811424.jpg",
    "category": "Battle Royale",
    "downloadLink": "https://ff.garena.com/en/",
    "description": "Free Fire MAX is a high-performance version of the popular battle royale shooter, offering enhanced graphics, smoother gameplay, and immersive sound effects for an elevated mobile gaming experience. Players are dropped onto an expansive island with up to 50 other competitors, where they must scavenge for weapons, gear, and resources while eliminating opponents to become the last one standing. The game features fast-paced matches, dynamic environments, and a variety of characters with unique skills that add strategic depth. With frequent updates, seasonal events, and customizable controls, Free Fire MAX combines intense action, tactical gameplay, and visually stunning arenas, making it one of the most exciting and engaging mobile survival shooters available today.",
    "ratings": 4.2,
    "developer": "Garena"
  },
  {
    "id": "8",
    "title": "Among Us",
    "coverPhoto": "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/945360/capsule_616x353.jpg?t=1757444903",
    "category": "Party",
    "downloadLink": "https://innersloth.com/gameAmongUs.php",
    "description": "Among Us is a popular social deduction game that challenges players to work together while uncovering hidden imposters within a crew. Set aboard a spaceship or various other locations, players complete tasks to maintain the ship and keep the crew operational. Meanwhile, one or more imposters secretly sabotage missions, create chaos, and attempt to eliminate crew members without being caught. Communication, observation, and strategy are key, as players must discuss suspicious behavior during emergency meetings and vote out the imposters. With cross-platform multiplayer, customizable characters, and constantly evolving strategies, Among Us provides an engaging, suspenseful, and highly social gaming experience that tests trust, deception, and teamwork.",
    "ratings": 4.5,
    "developer": "Innersloth"
  },
  {
    "id": "9",
    "title": "Mobile Legends: Bang Bang",
    "coverPhoto": "https://cdn.gamerbraves.com/2020/06/mobile-legends-bang-bang.jpg",
    "category": "MOBA",
    "downloadLink": "https://m.mobilelegends.com/",
    "description": "Mobile Legends: Bang Bang is a fast-paced 5v5 multiplayer online battle arena (MOBA) game that delivers intense real-time battles and strategic team gameplay on mobile devices. Players select from a diverse roster of heroes, each with unique skills and roles, and work together to destroy the enemy’s base while defending their own. The game emphasizes teamwork, coordination, and tactical decision-making, as players engage in dynamic matches filled with action-packed fights, tower sieges, and objective control. With ranked modes, seasonal events, frequent updates, and an active global community, Mobile Legends: Bang Bang provides a competitive and immersive experience that keeps players coming back for thrilling, fast-paced MOBA action anywhere, anytime.",
    "ratings": 4.3,
    "developer": "Moonton"
  },
  {
    "id": "10",
    "title": "Apex Legends Mobile",
    "coverPhoto": "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/1172470/f002ac48d98f501231e7d8bd3cc418b65c8d511a/capsule_616x353.jpg?t=1754578148",
    "category": "Battle Royale",
    "downloadLink": "https://www.ea.com/games/apex-legends/apex-legends-mobile",
    "description": "Apex Legends Mobile brings the thrilling hero-based shooter experience to mobile devices, combining fast-paced action with strategic gameplay. Players choose from a diverse roster of Legends, each with unique abilities and playstyles, and form squads to compete in intense battle royale matches. The game challenges players to coordinate, communicate, and make tactical decisions while navigating dynamic environments, looting weapons, and engaging in firefights. Apex Legends Mobile features optimized controls for touchscreen devices, stunning graphics, and a variety of game modes that keep the experience fresh. Regular updates, seasonal events, and competitive ranking systems ensure continuous excitement, making it a must-play for fans of fast, team-based shooters on the go.",
    "ratings": 4.4,
    "developer": "Respawn Entertainment"
  },
  {
    "id": "11",
    "title": "Subway Surfers",
    "coverPhoto": "https://i.ytimg.com/vi/oayEMtWXZ60/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLA6Smb7xVlk-ye1HXoOjOm0CKS9cA",
    "category": "Arcade",
    "downloadLink": "https://sybogames.com/games/subway-surfers/",
    "description": "Subway Surfers is an exhilarating endless runner game that challenges players to sprint through vibrant urban environments while dodging trains, barriers, and other obstacles. Players control their character to jump, slide, and weave between hazards while collecting coins, power-ups, and special items that boost scores and abilities. The game features colorful graphics, smooth animations, and dynamic camera angles that make the gameplay immersive and visually appealing. With daily missions, seasonal events, and global leaderboards, Subway Surfers encourages players to improve their skills and compete with friends worldwide. Its fast-paced, addictive gameplay and constant updates have made it one of the most popular and enduring endless runner games on mobile platforms.",
    "ratings": 4.5,
    "developer": "SYBO Games"
  },
  {
    "id": "12",
    "title": "Asphalt 9: Legends",
    "coverPhoto": "https://images.indianexpress.com/2018/12/Asphalt-9-Legends-759.jpg",
    "category": "Racing",
    "downloadLink": "https://asphaltlegends.com/",
    "description": "Asphalt 9: Legends is a thrilling mobile racing game that delivers high-speed action, stunning visuals, and an incredible lineup of real-world hypercars. Players can race across diverse locations and detailed tracks, performing jaw-dropping stunts, drifts, and jumps to outpace opponents. The game features a wide variety of cars from top manufacturers, each with unique handling and performance characteristics. With multiple modes, including career events, multiplayer races, and daily challenges, Asphalt 9 keeps players engaged with competitive and rewarding gameplay. Frequent updates, seasonal events, and a dynamic progression system ensure that every race is fresh and exciting. Its combination of arcade-style racing, realistic graphics, and immersive gameplay makes it one of the best mobile racing experiences available.",
    "ratings": 4.4,
    "developer": "Gameloft"
  },
  {
    "id": "13",
    "title": "Clash of Clans",
    "coverPhoto": "https://i.ytimg.com/vi/vmrVJ5UBdb4/maxresdefault.jpg",
    "category": "Strategy",
    "downloadLink": "https://supercell.com/en/games/clashofclans/",
    "description": "In this legendary strategy game, players build and develop their own village, manage resources, and train troops to defend against enemy attacks. By joining or creating clans, players can collaborate with friends and compete in epic Clan Wars, strategizing together to earn rewards and climb the leaderboards. The game combines careful planning, tactical combat, and long-term progression, challenging players to balance offense and defense. With frequent updates, special events, and a variety of units and spells, no two battles are ever the same. Its engaging gameplay, colorful graphics, and social features make it one of the most popular and enduring strategy games worldwide.",
    "ratings": 4.4,
    "developer": "Supercell"
  },
  {
    "id": "14",
    "title": "Candy Crush Saga",
    "coverPhoto": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTSNy7v1yPPv4UfvW0OvQN_aTlTXYBNVGrAmisMR_oWk2czw9w-3fG33NVlsf--GCaS_54&usqp=CAU",
    "category": "Puzzle",
    "downloadLink": "https://king.com/game/candycrush",
    "description": "Candy Crush Saga is a highly addictive match-three puzzle game that invites players into a colorful world full of sweet treats and challenging levels. The goal is to match three or more candies of the same type to clear them from the board, triggering satisfying combos and chain reactions. With hundreds of levels, unique obstacles, and special candies with powerful effects, the game constantly tests players’ strategic thinking and problem-solving skills. Candy Crush Saga also features themed events, limited-time challenges, and leaderboards, encouraging friendly competition with friends. Its vibrant visuals, cheerful soundtrack, and progressively tricky levels make it one of the most beloved and enduring puzzle games on mobile platforms.",
    "ratings": 4.6,
    "developer": "King"
  },
  {
    "id": "15",
    "title": "Temple Run 2",
    "coverPhoto": "https://i.ytimg.com/vi/MH4mg0PON2k/maxresdefault.jpg",
    "category": "Arcade",
    "downloadLink": "https://imangistudios.com/temple-run-2/",
    "description": "Temple Run 2 is an exciting endless running game that challenges players to navigate treacherous paths, dodge obstacles, and collect valuable treasures while sprinting through ancient temples. Players must jump over gaps, slide under barriers, and turn sharply to avoid traps, all while the pace steadily increases, keeping the gameplay thrilling and fast-paced. The game features stunning environments, dynamic camera angles, and power-ups that enhance speed, magnetism, and score multipliers. With daily missions, achievements, and global leaderboards, Temple Run 2 encourages players to beat their high scores and compete with friends. Its combination of adventure, reflex-based gameplay, and addictive mechanics makes it one of the most popular endless runner games worldwide.",
    "ratings": 4.3,
    "developer": "Imangi Studios"
  },
  {
    "id": "16",
    "title": "Real Racing 3",
    "coverPhoto": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSJUfE92u7tBYlyTXPyZCS678QVhAz8XBp9Tg&s",
    "category": "Racing",
    "downloadLink": "https://www.ea.com/games/real-racing/real-racing-3",
    "description": "Real Racing 3 is a high-quality mobile racing game that delivers a realistic driving experience with stunning graphics, detailed tracks, and licensed cars from top manufacturers like Ferrari, Porsche, and Lamborghini. Players can participate in hundreds of events across multiple locations, from street circuits to professional racetracks, testing their skills in time trials, championships, and multiplayer races. The game features dynamic real-world physics, precise handling, and immersive sound effects, making every race feel authentic. With social integration, players can compete against friends and other racers worldwide. Frequent updates, new cars, and seasonal events keep the gameplay fresh, making Real Racing 3 one of the most engaging and realistic racing experiences on mobile devices.",
    "ratings": 4.5,
    "developer": "EA Sports"
  },
  {
    "id": "17",
    "title": "BGMI: Battlegrounds Mobile India",
    "coverPhoto": "https://assets.krafton.in/files/bgmi-thumbnail.jpg",
    "category": "Battle Royale",
    "downloadLink": "https://www.battlegroundsmobileindia.com/",
    "description": "Battlegrounds Mobile India (BGMI) is the Indian version of the globally popular PUBG Mobile, designed exclusively for players in India. It delivers the same adrenaline-pumping battle royale experience, featuring intense multiplayer matches where 100 players parachute onto an island, scavenge for weapons, and fight to be the last one standing. BGMI offers a variety of maps, modes, and seasonal events, along with stunning graphics and smooth controls optimized for mobile gameplay. The game includes localized content, in-game events, and India-specific rewards that enhance the overall experience. With regular updates, anti-cheat systems, and engaging community tournaments, BGMI continues to provide thrilling action and competitive excitement for millions of Indian gamers.",
    "ratings": 4.4,
    "developer": "Krafton"
  },
  {
    "id": "18",
    "title": "Fortnite Mobile",
    "coverPhoto": "https://www.cyberpowerpc.com/blog/w/wp-content/uploads/2018/02/fortnite.jpg",
    "category": "Battle Royale",
    "downloadLink": "https://www.epicgames.com/fortnite/en-US/mobile",
    "description": "Fortnite Mobile brings the full Fortnite experience to the palm of your hand, combining fast-paced battle royale action with creative building mechanics and vibrant, cartoon-style visuals. Players parachute onto an ever-changing island, gather resources, and construct defensive structures while battling opponents to be the last one standing. The game’s dynamic environments and constant updates keep the experience fresh with new weapons, events, and themed seasons. Beyond the classic Battle Royale mode, Fortnite Mobile also includes Creative and Zero Build options, allowing players to express their creativity or focus purely on combat. With cross-platform play, regular collaborations, and an active community, Fortnite Mobile delivers an exciting and accessible experience for gamers everywhere",
    "ratings": 4.5,
    "developer": "Epic Games"
  },
  {
    "id": "19",
    "title": "Roblox",
    "coverPhoto": "https://images.tynker.com/blog/wp-content/uploads/20250414130639/roblox22.jpg",
    "category": "Sandbox",
    "downloadLink": "https://www.roblox.com/",
    "description": "Roblox is an immersive online platform that empowers players to create, share, and experience millions of unique user-generated worlds. It blends gaming, creativity, and community into one dynamic universe where imagination truly comes to life. Players can design their own games using Roblox Studio, a powerful yet beginner-friendly development tool, and share their creations with a global audience. From action and adventure to role-playing and simulation, the variety of experiences is endless. Roblox also encourages social interaction — players can chat, collaborate, and explore together in virtual worlds. With constant updates and limitless creativity, Roblox is more than a game — it’s an ever-growing digital universe.",
    "ratings": 4.3,
    "developer": "Roblox Corporation"
  },
  {
    "id": "20",
    "title": "Minecraft",
    "coverPhoto": "https://gaming-cdn.com/images/products/14986/616x353/minecraft-java-and-bedrock-edition-deluxe-collection-deluxe-collection-pc-game-microsoft-store-europe-cover.jpg?v=1696925849",
    "category": "Sandbox",
    "downloadLink": "https://www.minecraft.net/",
    "description": "Minecraft is a sandbox adventure game that gives players the freedom to explore, build, and survive in a vast, procedurally generated blocky world. From towering mountains to deep caves, every landscape is unique and full of endless possibilities. Players can gather resources, craft tools, and construct anything they can imagine — from simple homes to massive cities. In Survival mode, you must manage hunger, health, and fend off dangerous mobs at night, while Creative mode allows limitless building with no restrictions. With multiplayer options, mods, and regular updates, Minecraft offers a constantly evolving world where creativity truly has no boundaries.",
    "ratings": 4.8,
    "developer": "Mojang Studios"
  }
]
